app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
---
  def new

    all_artists

    if params[:artist_id] && !Artist.exists?(params[:artist_id])

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1234]]
SELECT  "songs".* FROM "songs" WHERE (2) LIMIT 1
---
  def edit
    # raise params.inspect
    all_artists

    if params[:artist_id]
      artist = Artist.find_by(id: params[:artist_id])
      if artist.nil?
        redirect_to artists_path, alert: "Artist not found."
      else
        @song = artist.songs.find_by(id: params[:id])

        redirect_to artist_songs_path(artist), alert: "Song not found." if @song.nil?
      end
    else
      @song = Song.find(params[:id])